<?php
	require_once dirname(__FILE__).DIRECTORY_SEPARATOR.'common.php';
	require_once dirname(__FILE__).DIRECTORY_SEPARATOR.'config.php';
//チーム名,ID,PWD,郵便番号,住所1,先生

$usertbl = array(
	array('札幌曙剣道道場','akebono','t7XAAcFb','006','0806','北海道','札幌市手稲区新発寒六条10-4-3','小山','篤'),
	array('秋水館笠岡道場','kasaokadojo','fpaW8Wc7','010','0145','秋田県','秋田市下新城笠岡字笠岡156','鎌田','耕平'),
	array('梅本少年剣友会','umehon','jB7X6ruU','124','0012','東京都','葛飾区立石6-7-11-203','伊達','政寛'),
	array('愛興館','aikokan','p9I7NSMF','188','0013','東京都','西東京市向台町5-5-4３','近藤','光'),
	array('昭島中央剣友会','akishima','Fhtpna8S','196','0001','東京都','昭島市美堀町2-25-26','三浦','昇一郎'),
	array('萌木剣道教室','omoegi','9qhIk4SF','196','0001','神奈川県','座間市相模が丘6-11-3','根本','善士將'),
	array('永山剣友会','nagayamakenyu','yEK9oH8J','206','0025','東京都','多摩市永山5-30-17-4','井口','一郎'),
	array('西木道場','nishiki','BxA8zZv2','221','0865','神奈川県','横浜市神奈川区片倉2-3-3','赤木','憲人'),
	array('自彊館道場','jikyokan','NEp9dgJH','224','0013','神奈川県','横浜市都筑区すみれが丘14-51','桜井','裕介'),
	array('養浩館道場','youkoukan','CC4ZpNCn','224','0013','神奈川県','横浜市都筑区すみれが丘14-51','桜井','裕介'),
	array('輝神館三山道場','kishinkanmiya','4iQxJR28','226','0011','神奈川県','横浜市緑区中山町190','三山','弁次'),
	array('BSC剣志会','bsc','5Ib3QMiS','232','0017','神奈川県','横浜市南区宿町2-36-2Ｆ','佐藤','伸夫'),
	array('桜剣士会','sakurakenshi','trW4DGLv','232','0072','神奈川県','横浜市南区永田東2-7-21','佐藤','和義'),
	array('久里浜剣友会','kurihama','65xyihRS','237','0072','神奈川県','横須賀市長浦町5-77-3','貝塚','昌通'),
	array('東深沢Ｓ・Ｃ剣道教室','higashifukasawa','dLoo4rd3','252','0001','神奈川県','座間市相模が丘6-11-3','松尾　','賢'),
	array('光武館道場','koubukan','9GcDV8j4','252','0233','神奈川県','相模原市中央区鹿沼台2-12-6','茅','弘秋'),
	array('鬼高剣友会','onitaka','mnU1N1WM','272','0015','千葉県','市川市鬼高4-7-6-212','西野','範昭'),
	array('佐貫清心館','seishinkan','88Bgk9B8','293','0057','千葉県','富津市亀田749','高橋','進一'),
	array('つくば少年剣友会','tsukuba','G8tPsC1L','300','4231','茨城県','つくば市北条364','駒館','義夫'),
	array('総和剣道クラブ','souwa','Try8cC4g','306','0235','茨城県','古河市下辺見2145-4','古谷','芳和'),
	array('猿島剣友会','sashikakenyu','4ZLu9oWw','306','0515','茨城県','坂東市沓掛３-1','木村','弘幸'),
	array('一心院道場','ishinin','qJ8AE1Tt','311','3122','茨城県','東茨城郡茨城町上石崎1877-1','平岡','永照'),
	array('いばらき少年剣友会','ibarakishonen','bo3iMFLZ','311','3131','茨城県','東茨城郡茨城町小堤970-8','雨谷','益水'),
	array('財団法人　勝田若葉会','katsutawakaba','h9Nhhkti','312','0052','茨城県','ひたちなか市東石川2-8-1','溝口','邦明'),
	array('俊水館道場','shunsui','4ozaQZMt','314','0128','茨城県','神栖市大野原中央3-7-15','金井','信彦'),
	array('蔵の街剣志会','kuranomachikenyu','adpm5Aop','323','0807','栃木県','小山市城東2-29-8','白石','輝志'),
	array('五葉館','goyokan','T8RdwqCv','329','2145','栃木県','矢板市富田374-11','長屋','太志'),
	array('中尾少年剣士会','nakaoshonen','HgmdU5jg','336','0932','埼玉県','さいたま市緑区中尾2321-8','山岸','三男'),
	array('武蔵館','musashikan','WAFt5pAT','343','0045','埼玉県','越谷市下間久里548-5','今濱','由美子'),
	array('埼玉越生錬成会','saitamaogose','LrKteC5h','350','0413','','入間郡越生町如意968-31','酒井','健太郎'),
	array('優心塾川井道場','yushinkawai','Js7BTX19','352','0023','埼玉県','新座市堀の内1-8-25','川井','人之'),
	array('桶川剣友会','okegawakenyu','trW4DGLv','363','0025','埼玉県','桶川市下日出谷943-95','七田','憲治'),
	array('解脱錬心館','gedatsurenshin','88Bgk9B8','364','0031','埼玉県','北本市中央1-123','田中','宏明'),
	array('荒川剣友会','arakawa','cdVBiZ5w','368','0031','埼玉県','秩父市荒川上田野664　','岩田','勝宏'),
	array('群馬修道館','gunmashudo','4ZLu9oWw','370','3607','群馬県','北群馬郡吉岡町小倉512-3','小竹','照明'),
	array('豊受剣和会','toyouke','e7NXjg85','372','0851','群馬県','伊勢崎市上蓮町93-4','長橋','徹'),
	array('さきがけ剣志会','sakigakekenyu','qJ8AE1Tt','377','0027','群馬県','渋川市金井2310金島小学校内','樺澤','康行'),
	array('沼田剣桜会道場','numatakenokai','Js7BTX19','378','0046','群馬県','沼田市馬喰町1240-14','田原','泰'),
	array('笠懸剣友会','kasagake','L5nPo3pe','379','2301','群馬県','太田市藪塚町1170-10','山藤','英津子'),
	array('藪塚剣道クラブ','yabutsuka','up8WjXd8','379','2304','群馬県','太田市大原町1043','木村','真之'),
	array('北長野剣友会','kitanagano','SnoC9jQU','380','0802','長野県','長野市桐原2-21-16','五十嵐','元一'),
	array('権堂少年剣友会','gondo','d8Jt6KUM','380','0901','長野県','長野市居町90-1パークタウン90-306','中村','勝芳'),
	array('権堂少年剣友会','gondo2','d8Jt6KUM','380','0901','長野県','長野市居町90-1パークタウン90-306','中村','勝芳'),
	array('大豆島少年剣道クラブ','mamejima','niUQo55H','381','0023','長野県','長野市大字風間918-2','市川','易三'),
	array('長野剣道スポーツ少年団','chospo','ecg6E8L8','381','0025','長野県','長野市北長池350朝陽職員宿舎Ａ棟105号','町田','育哉'),
	array('長野剣道スポーツ少年団','chospo2','ecg6E8L8','381','0025','長野県','長野市北長池350朝陽職員宿舎Ａ棟105号','町田','育哉'),
	array('若槻少年剣友会','wakatsuki','5Qb4cFnK','381','0042','長野県','長野市稲田1-3-11','今井','哲夫'),
	array('長野少年剣道クラブ','naganoshonen','UP5DvIut','381','0043','長野県','長野市吉田5-8-17','吉川','茂利'),
	array('若穂剣道育成会','wakaho','1NNpexcG','381','0102','長野県','長野市若穂保科3303-1','',''),
	array('寺尾少年剣道クラブ','terao','BM5LoFnf','381','1214','長野県','長野市松代町柴66','小林','正利'),
	array('東条育成会少年剣道クラブ','higashijo','Td4Y1tJr','381','1223','長野県','長野市皆神台235-27','竹前','翔太'),
	array('松代地区育成会剣道クラブ','matsushiroikuseikai','NEp9dgJH','381','1231','長野県','長野市松代町松代1116-7','宮澤','慶治'),
	array('松代地区育成会剣道クラブ','matsushiroikuseikai2','NEp9dgJH','381','1231','長野県','長野市松代町松代1116-7','宮澤','慶治'),
	array('清野育成会剣道クラブ','kiyono','4iQxJR28','381','1233','長野県','長野市松代町清野1943','永井','智達'),
	array('清野育成会剣道クラブ','kiyono2','4iQxJR28','381','1233','長野県','長野市松代町清野1943','永井','智達'),
	array('青木島剣道少年団','aokijima','gvwk5CuA','381','2206','長野県','長野市青木島綱島252-5','風間','大輔'),
	array('川中島少年剣友会','kawanakajimashonen','wMJRbGd3','381','2224','長野県','長野市川中島町原202-30','近藤','次夫'),
	array('悠心舘','yushinkan','Js8ceExJ','381','2233','長野県','長野市川中島上氷鉋686-11','稲田','義也'),
	array('須坂剣道連盟','suzakakendo','dbq56A6y','382','0052','長野県','須坂市塩川町231-8','根岸','正喜'),
	array('須高剣道連盟','sukokendo','8oxE3FVb','382','0800','長野県','上高井郡高山村大字高山3387-1','星川','輝雄'),
	array('中野市北部育成会少年剣道教室','nakanohokubu','g6SVzFcc','383','0004','長野県','中野市赤沼639-4','小林','和夫'),
	array('中野市剣道スポーツ少年団','nakanokendo','8d6ifQEM','383','8614','長野県','中野市三好町一丁目3-19','保科　','謙一'),
	array('小諸少年剣道クラブ','komoroshonen','zYJ91mAF','384','0083','長野県','小諸市市703-8','滝沢','泰'),
	array('美里少年剣道クラブ','misatoshonen','dbNZE8jW','384','0084','長野県','小諸市耳取2369','山浦','義晴'),
	array('修錬会','shurenkai','Y2DL7j5n','386','0012','長野県','上田市常盤3-14-7','田中','佑季'),
	array('上田神科分団','uedakamishina','Y2DL7j5n','386','0012','長野県','上田市常盤3-14-7','田中','佑季'),
	array('上田中央分団','uedachuo','Y2DL7j5n','386','0012','長野県','上田市常盤3-14-7','田中','佑季'),
	array('更埴東部育成会剣道部','koshokutobu','2a8zGRFp','387','0003','長野県','千曲市生萱120','近藤','克己'),
	array('五加育成会剣道クラブ','goka','zff4B2vy','387','0011','長野県','千曲市杭瀬下6丁目101','宮坂','隆彦'),
	array('ちくま剣道育成会','chikumakendo','Ax639Hhb','387','0017','長野県','千曲市中313','山崎','尚'),
	array('桑原スポーツ少年団','kuwabara','fRrw3Gt3 ','387','0024','長野県','千曲市大字桑原1472-3','伊藤','啓一'),
	array('南長野剣道少年団','minaminagano','RhvbJ7fR','388','2225','長野県','長野市篠ノ井岡田180-11','上野','敏夫'),
	array('篠ノ井剣友会','shinonoi','ntzVV4KW','388','8004','長野県','長野市篠ノ井会290','小林','貞保'),
	array('稲里剣道クラブ','inasato','IuRsc3cC','388','8019','長野県','長野市篠ノ井杵淵66-4','吉池','重則'),
	array('西寺尾育成会柔剣道部','nishiderao','Y3WXDFiq','388','8019','長野県','長野市篠ノ井杵淵839','宮澤','聡志'),
	array('軽井沢少年剣道クラブ','karuizawakendo','2V2B3fi8','389','0111','長野県','北佐久郡軽井沢町大字長倉2139-3111','関','順'),
	array('坂城剣道錬成会','sakakikendo','jtWrfiA1','389','0602','長野県','埴科郡坂城町中之条2468','笠井','識敬'),
	array('豊野町少年剣道クラブ','toyonokendo','AKC88gIB','389','1105','長野県','長野市豊野町大字豊野515-9','大田','巧'),
	array('富士里少年剣友会','fujisato','DAdA3jDo','389','1313','長野県','上水内郡信濃町穂波1396-1','小坂','隆弘'),
	array('飯山剣道連盟','iiyama','eNQEXK6b','389','2413','長野県','飯山市大字照里548','丸山','一司'),
	array('飯山常盤少年剣道クラブ','tokiwa','3TWnJpQ6','389','2413','長野県','飯山市大字照里548','金崎','恵'),
	array('松筑剣道連盟','shochiku','KVNmy2x3','390','0221','長野県','松本市里山辺4059','百瀬裕','北原靖久'),
	array('原村剣道クラブ','haramurakendo','w9TkQ6vL','391','0108','長野県','諏訪郡原村八ツ手3663-1','小池','正樹'),
	array('諏訪尚武館道場','suwashobukan','2bZT9VK9','392','0026','長野県','諏訪市高島3丁目1405-1','吉岡','信幸'),
	array('上伊那少年剣士会','kamiinashonen','UuLtWvP1','396','0113','長野県','伊那市荒井4503-12','飯島','浩'),
	array('對山館','taizankan','v2LmiG7P','398','0001','長野県','大町市大町2226','西澤','剛'),
	array('塩尻剣道連盟','shiojirikendo','Z8ZkD3uy','399','0711','長野県','塩尻市大字片丘7315-1','坂野','徹'),
	array('下條少年剣道クラブ','shimojoshonen','7CvGzxgC','399','2101','長野県','下伊那郡下條村睦沢8844-1','佐々木','学'),
	array('安曇野市三郷少年剣道クラブ','azuminomisato','Ty9ViRd9','399','8102','長野県','安曇野市三郷温1914-1','二木','義弘'),
	array('安曇野市少年剣道クラブ','azuminokendo','Ty9ViRd9','399','8102','長野県','安曇野市三郷温1914-1','二木','義弘'),
	array('安曇野市穂高少年剣道クラブ','azuminohotaka','Ty9ViRd9','399','8102','長野県','安曇野市三郷温1914-1','二木','義弘'),
	array('致道館','chidokan','wUh9VQBg','400','0053','山梨県','甲府市大里町3785-2（甲府市立大里小学校）','小林','裕子'),
	array('山城剣友会','yamashiro','YzXG6Ync','400','0831','山梨県','甲府市上町1461','岡','政吉'),
	array('甲南剣友会','konan','I8GjwmN9','400','0851','山梨県','甲府市住吉2-1-52　23号','宮川','昇'),
	array('山梨健心館','yamanashikenshin','7WySo4ji','409','3804','','中央市安之口150-2','清野','忍'),
	array('山梨中央スポーツ少年団','yamanashikenshin2','xBfK7eba','409','3804','','中央市安之口150-2','清野','忍'),
	array('三島剣道スポーツ少年団','mishimakendo','88Bgk9B8','411','0025','','三島市壱町田82-10長谷川ハイツＢ棟','村松','弘之'),
	array('静岡武修館','shizuokabushukan','4ZLu9oWw','420','0874','','静岡市葵区辰起町8-17','金原','友昭'),
	array('水龍舘','suiryukan','qJ8AE1Tt','421','0301','','榛原郡吉田町住吉2232','水野','貴仁'),
	array('青島剣道スポーツ少年団','aoshimakendo','bo3iMFLZ','426','0041','','静岡県藤枝市高柳3-2-6','杉本','好基'),
	array('初真会','hatsushinkai','bo3iMFLZ','427','0107','','島田市 船木2462-2','増尾','幸伸'),
	array('剣修舘道場','kenshukan','h9Nhhkti','430','0803','','浜松市東区植松町63-6','林','芳郎'),
	array('尚道館','shodokan','adpm5Aop','438','0074','','磐田市二之宮1695-4','井筒','功典'),
	array('磐田剣道連盟','iwatakendo','4ozaQZMt','438','0074','','磐田市二之宮1695-4','松下','耕三'),
	array('平坂小学校剣道部','heisakasho','h9Nhhkti','444','0305','愛知県','西尾市平坂町輪当1番地','伊澤','直人'),
	array('玄武道場','genbudojo','4ozaQZMt','444','0311','愛知県','西尾市新在家町西郷12-1','熊谷','常男'),
	array('矢田小学校剣道部','yatasho','adpm5Aop','444','0313','愛知県','西尾市上矢田町神明寺24','大須賀','勇太'),
	array('斉年寺道場剣志会','sainenji','HgmdU5jg','457','0833','愛知県','名古屋市南区東又兵ヱ町2-134','下山','博之'),
	array('千代が丘剣道教室','chiyogaoka','trW4DGLv','465','0005','','名古屋市千種区千代ヶ丘5-50ショッピングコスモ3Ｆ','大川','光都子'),
	array('武徳館剣道教室','budokukan','WAFt5pAT','467','0027','愛知県','名古屋市瑞穂区田辺通4-25鶴陽明ﾊｲﾂ306','田村','彰大'),
	array('さくら会少年剣道部','sakurakai','HgmdU5jg','505','0305','','加茂郡八百津町和知227-5','三好','史恭'),
	array('飛騨清見聖心館道場','hidakiyomi','WAFt5pAT','506','0103','','高山市清見町藤瀬568-3','野中','聖司'),
	array('敦賀市剣道スポーツ少年団','tsurugakendo','QB925pZd','914','0058','','敦賀市三島町1丁目1-34','馬渕','清和'),
	array('新風館愛宕坂道場','atagozakadojo','Js7BTX19','918','8007','福井県','福井市足羽1-8-16','相模','利朗'),
	array('游神館','yushinkan','D3npy83F','920','0944','','金沢市三口新町1-16-22','杉山','剛'),
	array('森本少年剣道教室','ishikawa1','trW4DGLv','920','3115','石川県','金沢市弥勒町力144-6','冨田','東'),
	array('小松桜木剣正館','ishikawa2','88Bgk9B8','923','0948','石川県','小松市錦町43','藤井','勝司'),
	array('辰口武道館','tatsuguchi','X3xIit19','923','1243','','能美市三ツ屋町ホ66-3','山本','浩孝'),
	array('蕪城剣道スポーツ少年団','kabuki','CVn3KU2L','924','0023','','白山市成町293-3','中','剛'),
	array('新化館','shinkakan','WWf35mLk','929','1195','','かほく市宇野気ニ81番地','森','尊史'),
	array('県営富山武道館','toyamabudokan','4ZLu9oWw','930','0858','富山県','富山市牛島町2-10','佐藤','寛'),
	array('小杉南剣道教室','kosugiminami','qJ8AE1Tt','939','0362','富山県','射水市小杉町太閤山7-50-1','中原','孝志'),
	array('凌雲館村雲道場','ryounkanmuragumo','I61SzcwK','939','8042','','富山市太田北区80-145','村雲','荘一'),
	array('高田修道館','takadashudokan','YDKmE15z','943','0835','','上越市本城町4-67','直原','幹'),
	array('吉川剣道教室','yoshikawa','rn85T3gx','949','3403','','上越市吉川区平等寺167','杉田','雅俊'),
	array('五十沢剣道クラブ','isawakendo','bo3iMFLZ','949','6771','新潟県','南魚沼市津久野709-2','山田','幹二'),
	array('白根剣士会道場','shiranekenshi','h9Nhhkti','950','1213','新潟県','新潟市南区能登948-12','鈴木','達也'),
	array('上通剣士会','kamidori','A2mht2NL','954','0133','','長岡市大曲戸新田521-2','渡辺','義浩'),
	array('新発田發慶館','shibata1','4ozaQZMt','957','0124','新潟県','北蒲原郡聖籠町蓮野1163-10','加藤','響'),
	array('一好会','ikkokai','yFu81Fha','958','0857','','村上市飯野3-4-20','中島','善夫'),
	array('地蔵堂剣士会','jizodo','DcAv2XoS','959','0114','','燕市一ノ山2-5-2','村山','雅彦'),
	array('草野剣道スポーツ少年団','kusanokendo','adpm5Aop','970','0112','福島県','いわき市平泉崎字砂田8-2','馬目','桂一'),
	array('富岡町剣友会','tomiokaken','HgmdU5jg','979','1111','福島県','双葉郡富岡町小浜1-1','佐藤','正人'),
	array('尚武殿一森山道場','shobuden1','WAFt5pAT','985','0061','宮城県','塩竈市清水沢3-27-12','菅原','恵美'),
	array('吉成剣友会','yoshinari1','Js7BTX19','989','3205','宮城県','仙台市青葉区吉成2-10-32','田代','信子')
);

	$dbs = db_connect( DATABASE_HOST, DATABASE_USER, DATABASE_PASSWORD, DATABASE_NAME );
	foreach( $usertbl as $ul ){
		$pref = 0;
		$sql = 'select * from `zip_table` where `zip`=\'' . $ul[3] . $ul[4] . '\'';
		$list = db_query_list( $dbs, $sql );
		if( count($list) > 0 ){
			$pref = intval( substr( $list[0]['jis'], 0, -3 ) );
		}

		$sql = 'insert into `entry_info` set `series`=3,`create_date`=NOW(),`update_date`=NOW(),`del`=0';
		db_query( $dbs, $sql );
		$id = db_query_insert_id( $dbs );

		$sql = 'insert into `entry_field` (`info`,`field`,`data`) values ';
		$sql .= ( '('.$id.',\'school_name\',\''.$dbs->real_escape_string( $ul[0] ).'\'),' );
		$sql .= ( '('.$id.',\'school_address_zip1\',\''.$ul[3].'\'),' );
		$sql .= ( '('.$id.',\'school_address_zip2\',\''.$ul[4].'\'),' );
		$sql .= ( '('.$id.',\'school_address_pref\',\''.$pref.'\'),' );
		$sql .= ( '('.$id.',\'school_address\',\''.$dbs->real_escape_string( $ul[6] ).'\')' );
	//	$sql .= ( '('.$id.',\'school_address\',\''.$dbs->real_escape_string( $ul[7] ).'\'),' );
	//	$sql .= ( '('.$id.',\'school_address\',\''.$dbs->real_escape_string( $ul[8] ).'\')' );
		db_query( $dbs, $sql );

		$sql = 'insert into `entry_users` set'
			. ' `series`=3,'
			. ' `info`=' . $id . ','
			. ' `user_name`=\'' . $ul[1] . '\','
			. ' `user_pass`=SHA1(\'' . $ul[2] . '\')';
		db_query( $dbs, $sql );

	}
?>
