<?php
	require_once dirname(__FILE__).DIRECTORY_SEPARATOR.'common.php';
	require_once dirname(__FILE__).DIRECTORY_SEPARATOR.'config.php';
//県名,学校名,学校名,学校名略称,ID,PWD,学校名全部,郵便番号,住所1

$usertbl = array(
	array('神奈川県','横浜','市立',1,'保土ヶ谷中学校','保土ヶ谷中','hodogaya','rZy4omZd','横浜市立保土ヶ谷中学校','240','0066','横浜市保土ヶ谷区釜台町3-1'),
	array('神奈川県','','私立',2,'横浜中学校','横浜中','rokukakubashi','VqL6eLRa','私立横浜中学校','236','0053','横浜市金沢区能見台通46-1'),
	array('神奈川県','横浜','市立',1,'港中学校','港中','honjuku','YQzh7Kg7','横浜市立港中学校','231','0023','横浜市中区山下町241番地'),
	array('神奈川県','横浜','市立',1,'都田中学校','都田中','tsuda','x8LJev1c','横浜市立都田中学校','224','0053','横浜市都筑区池辺町2818'),
	array('神奈川県','横浜','市立',1,'潮田中学校','潮田中','ushioda','CqsjzAc1','横浜市立潮田中学校','230','0037','横浜市鶴見区向井町4-83'),
	array('青森県','大間','町立',6,'大間中学校','大間中','oma','Y17wJa8c','大間町立大間中学校','039','4601','青森県下北郡大間町大字大間字大間平31-1'),
	array('岩手県','花巻','市立',1,'石鳥谷中学校','石鳥谷中','ishidoriya','XRM2pADX','花巻市立石鳥谷中学校','028','3163','岩手県花巻市石鳥谷町八幡6-37-1'),
	array('岩手県','花巻','市立',1,'花巻中学校','花巻中','hanamaki','cg5HRcqS','花巻市立花巻中学校','025','0097','岩手県花巻市若葉町2丁目16番22号'),
	array('秋田県','秋田','市立',1,'山王中学校','山王中','sanno','XfTebqN3','秋田市立山王中学校','010','0951','秋田市山王3丁目1番24号'),
	array('秋田県','秋田','市立',1,'秋田西中学校','秋田西中','akitanishi','LY8ts4Dg','秋田市立秋田西中学校','010','1632','秋田市新屋大川町19番75号'),
	array('宮城県','奥州','市立',1,'若柳中学校','若柳中','wakayanagi','JkoJd53B','奥州市立若柳中学校','023','0403','岩手県奥州市胆沢区若柳字土橋30'),
	array('宮城県','岩沼','市立',1,'岩沼西中学校','岩沼西中','iwanumanishi','1FpYonnR','岩沼市立岩沼西中学校','989','2464','宮城県岩沼市三色吉字竹11番地'),
	array('山形県','山形','市立',1,'山形六中学校','山形六中','yamagataroku','KasEAu7g','山形市立山形六中学校','990','2413','山形県山形市南原町2丁目3-55'),
	array('山形県','遊佐','町立',6,'遊佐中学校','遊佐中','yuza','VF18Ts8i','遊佐町立遊佐中学校','999','8311','遊佐町小原田字上川原18-1'),
	array('福島県','いわき','市立',1,'平第二中学校','平第二中','tairani','6oYXx5rD','いわき市立平第二中学校','970','8023','いわき市平鎌田字味噌能2番地'),
	array('福島県','福島','市立',1,'福島第一中学校','福島第一中','fukushimaichi','4ARPXcdq','福島市立福島第一中学校','960','8162','福島市南町480'),
	array('埼玉県','川口','市立',1,'芝東中学校','芝東中','shibahigashi','MAI9vHT8','川口市立芝東中学校','333','0867','川口市芝東町3-1'),
	array('埼玉県','春日部','市立',1,'大沼中学校','大沼中','oonuma','4xo1JfKt','春日部市立大沼中学校','344','0038','春日部市大沼6-75'),
	array('千葉県','柏','市立',1,'光ヶ丘中学校','光ヶ丘中','hikarigaoka','oWdT1yiX','柏市立光ヶ丘中学校','277','0065','柏市光ヶ丘4-23-1'),
	array('千葉県','柏','市立',1,'逆井中学校','逆井中','sakasai','BKUocbV4','柏市立逆井中学校','277','0042','柏市逆井555'),
	array('千葉県','千葉','市立',1,'幕張本郷中学校','幕張本郷中','makuharihongo','IxnWXvo9','千葉市立幕張本郷中学校','262','0033','千葉市花見川区幕張本郷5-18-1'),
	array('千葉県','千葉','市立',1,'稲毛中学校','稲毛中','chibakokusai','TQxkc8UD','千葉市立稲毛中学校','263','0035','千葉市稲毛区稲毛町5丁目120番地'),
	array('千葉県','千葉','市立',1,'千城台南中学校','千城台南中','chishirodai','vJeTgP9j','千葉市立千城台中学校','264','0003','千葉県千葉市若葉区千城台南1－20－1'),
	array('茨城県','取手','市立',1,'戸頭中学校','戸頭中','togashira','28zuAh33','取手市立戸頭中学校','302','0034','取手市戸頭7-1-1'),
	array('茨城県','阿見','町立',6,'阿見中学校','阿見中','ami','GXBrWvp4','阿見町立阿見中学校','300','0332','茨城県稲敷郡阿見町中央1丁目2番1号'),
	array('茨城県','','私立',2,'茗渓学園中学校','茗渓学園中','meikei','UWI8gGjo','私立茗渓学園中学校','305','8502','茨城県つくば市稲荷前1-1'),
	array('茨城県','古河','市立',1,'総和中学校','総和中','sowa','jv4WP6aB','古河市立総和中学校','306','0226','古河市女沼290-1'),
	array('群馬県','前橋','市立',1,'桂萱中学校','桂萱中','kaigaya','AYhNV38f','前橋市立桂萱中学校','371','0007','群馬県前橋市上泉町175'),
	array('群馬県','吉岡','町立',6,'吉岡中学校','吉岡中','kasagake','JoL2DVeq','吉岡町立吉岡中学校','370','3604','群馬県北群馬郡吉岡町南下1383-2'),
	array('群馬県','榛東','村立',5,'榛東中学校','榛東中','shinto','dSkNw1dn','榛東村立榛東中学校','370','3503','北群馬郡榛東村新井598'),
	array('群馬県','高崎','市立',1,'倉賀野中学校','倉賀野中','kuragano','MgZ3RirB','高崎市立倉賀野中学校','370','1201','高崎市倉賀野町1270'),
	array('山梨県','中央','市立',1,'玉穂中学校','玉穂中','tamaho','My7oss4w','中央市立玉穂中学校','400','0831','中央市下河東180'),
	array('新潟県','燕','市立',1,'小池中学校','小池中','koike','aQ8mqoLt','燕市立小池中学校','959','1265','燕市道金1095-1'),
	array('新潟県','燕','市立',1,'燕中学校','燕中','tsubame','wCFY5juv','燕市立燕中学校','959','1261','燕市秋葉町4-8-71'),
	array('新潟県','長岡','市立',1,'中之島中学校','中之島中','nakanoshima','eD3kH317','長岡市立中之島中学校','954','0173','長岡市中野東2649-1'),
	array('新潟県','新潟','市立',1,'白根第一中学校','白根第一中','shiraneichi','9NNVfNwH','新潟市立白根第一中学校','950','1217','新潟市南区白根407番地'),
	array('新潟県','上越','市立',1,'吉川中学校','吉川中','yoshikawa','TJ2shmE1','上越市立吉川中学校','949','3443','上越市吉川区下町1130'),
	array('新潟県','新潟','市立',1,'小針中学校','小針中','kobari','4sk57S9X','新潟市立小針中学校','950','2022','新潟市西区小針1-37-1'),
	array('富山県','富山','市立',1,'堀川中学校','堀川中','horikawa','Zkcx5oj5','富山市立堀川中学校','939','8081','富山市堀川小泉町1-21-15'),
	array('富山県','富山','市立',1,'山室中学校','山室中','yamamuro','97mHS3Ah','富山市立山室中学校','939','8006','富山市山室30-1'),
	array('富山県','砺波','市立',1,'庄川中学校','庄川中','shogawa','w8Zj82FX','砺波市立庄川中学校','932','0314','富山県砺波市庄川町青島3938'),
	array('富山県','射水','市立',1,'射北中学校','射北中','ihoku','TPSMkdx8','射水市立射北中学校','933','0224','射水市堀岡古明神20'),
	array('石川県','かほく','市立',1,'宇ノ気中学校','宇ノ気中','unoke','GYH6stTv','かほく市立宇ノ気中学校','929','1123','かほく市森レ1'),
	array('石川県','羽咋','市立',1,'羽咋中学校','羽咋中','hakui','n9XFpo7x','羽咋市立羽咋中学校','925','0052','羽咋市中央町59'),
	array('福井県','敦賀','市立',1,'松陵中学校','松陵中','shoryo','ogsK6rac',' 敦賀市立松陵中学校','914','0807','福井県敦賀市松葉町1－1'),
	array('愛知県','西尾','市立',1,'鶴城中学校','鶴城中','tsurushiro','4v2TDCaz','西尾市立鶴城中学校','445','0805','西尾市鶴城町上道天1-2'),
	array('愛知県','西尾','市立',1,'平坂中学校','平坂中','heisaka','BGL31yiv','西尾市立平坂中学校','445','0305','西尾市平坂町吉山1-1'),
	array('岐阜県','高山','市立',1,'清見中学校','清見中','kiyomi','h7TLHvc8','高山市立清見中学校','506','0102','高山市清見町三日町477-1'),
	array('岐阜県','郡上','市立',1,'大和中学校','大和中','yamato','p69Z78Fh','郡上市立大和中学校','501','4612','郡上市大和町剣100'),
	array('静岡県','浜松','市立',1,'積志中学校','積志中','sekishi','Ww4YvYdN','浜松市立積志中学校','430','0946','浜松市中区松城町108-1'),
	array('静岡県','浜松','市立',1,'南部中学校','南部中','hamamatsunanbu','W3YxA7Yx','浜松市立南部中学校','430','0924','浜松市龍禅寺町706'),
	array('静岡県','','学校組合立',4,'御前崎中学校','御前崎中','omaezaki','dQ45u3Mc','学校組合立御前崎中学校','421','0533','牧之原市新庄800-1'),
	array('三重県','四日市','市立',1,'西朝明中学校','西朝明中','nishiasake','Cd4Kzw5k','四日市市立西朝明中学校','512','8051','三重県四日市市北山町1169'),
	array('大阪県','大阪','市立',1,'住吉第一中学校','住吉第一中','sumiyoshiichi','vCDFF2GC','大阪市立住吉第一中学校','559','0007','大阪府大阪市住之江区粉浜西1丁目5-11'),
	array('大阪県','大阪','市立',1,'上宮中学校','上宮中','mikuni','I7L6VAKa','学校法人上宮中学校','543','0037','大阪府大阪市天王寺区上之宮町3番16号'),
	array('滋賀県','','',0,'比叡山中学校','比叡山中','hieizan','epLE3JI2','比叡山中学校','520','0113','滋賀県大津市坂本4-3-1'),
	array('京都県','久御山','町立',6,'久御山中学校','久御山中','kumiyama','YwLZ4cJr','久御山町立久御山中学校','613','0042','久世郡久御山町坊之池高河原5'),
	array('徳島県','阿南','市立',1,'那賀川中学校','那賀川中','nakagawa','AeAStwu7','阿南市立那賀川中学校','779','1235','阿南市立那賀川町苅屋370ー1'),
	array('和歌山県','和歌山','市立',1,'西和中学校','西和中','seiwa','BU8nEisk','和歌山市立西和中学校','640','8272','和歌山県和歌山市砂山南3丁目3-9'),
	array('和歌山県','和歌山','市立',1,'西浜中学校','西浜中','nishihama','R8mQ4vip','和歌山市立西浜中学校','641','0031','和歌山県和歌山市西小二里1丁目6-1'),
	array('兵庫県','上郡','町立',6,'上郡中学校','上郡中','kamigoori','jZL3Zdon','上郡町立上郡中学校','678','1241','兵庫県赤穂郡上郡町山野里1178-1'),
	array('兵庫県','加古川','市立',1,'加古川中部中学校','加古川中部中','kakogawachubu','BxW9UVhE','加古川市立加古川中部中学校','675','0017','兵庫県加古川市野口町良野890-1'),
	array('高知県','','私立',2,'高知中学校','高知中学校','kochi','4ATjhRnC','私立高知中学校','780','0956','高知県高知市北端町100'),
	array('愛媛県','愛南','町立',6,'城辺中学校','城辺中','johen','UXapk1sm','愛南町立城辺中学校','789','4110','愛媛県南宇和郡愛南町城辺甲2707番地'),
	array('鳥取県','','私立',2,'米子北斗中学校','米子北斗中','yonagohokuto','g18DgIFU','私立米子北斗中学校','683','0851','鳥取県米子市夜見町50'),
	array('岡山県','勝央','町立',6,'勝央中学校','勝央中','shouo','EnmI2L6t','勝央町立勝央中学校','709','4334','岡山県勝田郡勝央町平1000'),
	array('長野県','千曲','市立',1,'戸倉上山田中学校','戸倉上山田中','togami','HdoLa7pk','','','',''),
	array('長野県','千曲','市立',1,'更埴西中学校','更埴西中','koshokunishi','YTK6Voyt','','','',''),
	array('長野県','坂城','町立',6,'坂城中学校','坂城中','sakaki','w6KSS5hj','','','',''),
	array('長野県','長野','市立',1,'柳町中学校','柳町中','yanagimachi','7S252WQd','','','',''),
	array('長野県','長野','市立',1,'豊野中学校','豊野中','toyono','r11BMr8p','','','',''),
	array('長野県','長野','市立',1,'篠ノ井西中学校','篠ノ井西中','shinonoinishi','WGdw61Mc','','','',''),
	array('長野県','長野','市立',1,'篠ノ井東中学校','篠ノ井東中','shinonoihigashi','kBZ9Lx89','','','',''),
	array('長野県','長野','市立',1,'若穂中学校','若穂中','wakaho','Xt8R99dY','','','',''),
	array('長野県','長野','市立',1,'川中島中学校','川中島中','kawanakajima','sZPrZ8cn','','','',''),
	array('長野県','長野','市立',1,'裾花中学校','裾花中','susobana','ER1Lk1oQ','','','',''),
	array('長野県','長野','市立',1,'東部中学校','長野東部中','naganotobu','1r7tas1G','','','',''),
	array('長野県','長野','市立',1,'犀陵中学校','犀陵中','sairyo','mUvx6zyL','','','',''),
	array('長野県','長野','市立',1,'北部中学校','長野北部中','naganohokubu','2gHobwoT','','','',''),
	array('長野県','佐久','市立',1,'浅間中学校','浅間中','asama','o38zmRp8','','','',''),
	array('長野県','佐久','市立',1,'望月中学校','望月中','mochizuki','Y92KvBrH','','','',''),
	array('長野県','上田','市立',1,'上田第二中学校','上田第二中','uedani','bX8ebr5k','','','',''),
	array('長野県','上田','市立',1,'上田第三中学校','上田第三中','uedasan','56GcsJ9N','','','',''),
	array('長野県','上田','市立',1,'上田第六中学校','上田第六中','uedaroku','KEWTm4fN','','','',''),
	array('長野県','軽井沢','町立',6,'軽井沢中学校','軽井沢中','karuizawa','SvoITno6','','','',''),
	array('長野県','東御','市立',1,'東部中学校','東御東部中','tobu','NLe5DFRd','','','',''),
	array('長野県','佐久','市立',1,'佐久長聖中学校','佐久長聖中','sakuchosei','wojg97Yo','','','',''),
	array('長野県','塩尻','市立',1,'広陵中学校','広陵中','koryo','17zowoqI','','','',''),
	array('長野県','塩尻','市立',1,'塩尻西部中学校','塩尻西部中','shiojiriseibu','GkQqxm5U','','','',''),
	array('長野県','塩尻','市立',1,'丘中学校','丘中','oka','z2qGvCiK','','','',''),
	array('長野県','安曇野','市立',1,'穂高西中学校','穂高西中','hotakanishi','VBf5GLk3','','','',''),
	array('長野県','安曇野','市立',1,'穂高東中学校','穂高東中','hotakahigashi','9JUTmRto','','','',''),
	array('長野県','','学校組合立',4,'筑北中学校','筑北中','chikuhoku','BQSmV54j','','','',''),
	array('長野県','','学校組合立',4,'鉢盛中学校','鉢盛中','hachimori','HroHcM6z','','','',''),
	array('長野県','下條','村立',5,'下條中学校','下條中','shimojo','mNDgqI4H','','','',''),
	array('長野県','松川','町立',6,'松川中学校','松川中','matsukawa','nrUVI9S6','','','',''),
	array('長野県','伊那','市立',1,'東部中学校','伊那東部中','inatobu','WJaTYKs7','','','',''),
	array('長野県','岡谷','市立',1,'西部中学校','岡谷西部中','okayaseibu','3BLTsk4J','','','',''),
	array('長野県','伊那','市立',1,'高遠中学校','高遠中','takato','ZLmQ1AU4','','','',''),
	array('長野県','飯田','市立',1,'竜峡中学校','竜峡中','ryukyo','HF8qJtQp','','','',''),
	array('長野県','飯田','市立',1,'緑ヶ丘中学校','緑ヶ丘中','midorigaoka','R2MRvtQB','','','',''),
	array('長野県','長野','市立',1,'松代中学校','松代中','matsushiro','S18obNyx','','','','')
/*
	array('','','','','matsushiro2','HnwR7Ea6','','','',''),
	array('','','','','matsushiro3','YfkHyg94','','','',''),
	array('','','','','kkma1','U8t9G7pa','','','',''),
	array('','','','','kkma2','pQUohbe4','','','',''),
	array('','','','','kkma3','tE9o2ZIa','','','',''),
	array('','','','','kkma4','t2yP1RpJ','','','','')
*/
);

	$dbs = db_connect( DATABASE_HOST, DATABASE_USER, DATABASE_PASSWORD, DATABASE_NAME );
	foreach( $usertbl as $ul ){
		$pref_str = $ul[9] . $ul[10];
		if( $pref_str == '' ){
			$pref = 20;
		} else {
			$pref = 0;
			$sql = 'select * from `zip_table` where `zip`=\'' . $pref_str . '\'';
			$list = db_query_list( $dbs, $sql );
			if( count($list) > 0 ){
				$pref = intval( substr( $list[0]['jis'], 0, -3 ) );
			}
		}

		$sql = 'insert into `entry_info` set `series`=2,`create_date`=NOW(),`update_date`=NOW(),`del`=0';
		db_query( $dbs, $sql );
		$id = db_query_insert_id( $dbs );

		$sql = 'insert into `entry_field` (`info`,`field`,`data`) values ';
		$sql .= ( '('.$id.',\'school_org\',\''.intval( $ul[3] ).'\'),' );
		$sql .= ( '('.$id.',\'school_org_school_name\',\''.$dbs->real_escape_string( $ul[1] ).'\'),' );
		$sql .= ( '('.$id.',\'school_name\',\''.$dbs->real_escape_string( $ul[4] ).'\'),' );
		$sql .= ( '('.$id.',\'school_address_zip1\',\''.$ul[9].'\'),' );
		$sql .= ( '('.$id.',\'school_address_zip2\',\''.$ul[10].'\'),' );
		$sql .= ( '('.$id.',\'school_address_pref\',\''.$pref.'\'),' );
		$sql .= ( '('.$id.',\'school_address\',\''.$dbs->real_escape_string( $ul[11] ).'\')' );
		db_query( $dbs, $sql );

		$sql = 'insert into `entry_users` set'
			. ' `series`=2,'
			. ' `info`=' . $id . ','
			. ' `user_name`=\'' . $ul[6] . '\','
			. ' `user_pass`=SHA1(\'' . $ul[7] . '\')';
		db_query( $dbs, $sql );

	}

/*
insert into `entry_info` set `series`=2,`create_date`=NOW(),`update_date`=NOW(),`del`=0;
insert into `entry_info` set `series`=2,`create_date`=NOW(),`update_date`=NOW(),`del`=0;
insert into `entry_info` set `series`=2,`create_date`=NOW(),`update_date`=NOW(),`del`=0;
insert into `entry_info` set `series`=2,`create_date`=NOW(),`update_date`=NOW(),`del`=0;
insert into `entry_info` set `series`=2,`create_date`=NOW(),`update_date`=NOW(),`del`=0;

insert into `entry_field` (`info`,`field`,`data`) values (270,'school_name',''),(271,'school_name',''),(272,'school_name',''),(273,'school_name',''),(274,'school_name','');

insert into `entry_users` set `series`=2,`info`=279,`user_name`='kkma30',`user_pass`=SHA1('jaabnjgb');
insert into `entry_users` set `series`=2,`info`=281,`user_name`='kkma31',`user_pass`=SHA1('56gcsj9n');
insert into `entry_users` set `series`=2,`info`=281,`user_name`='kkma32',`user_pass`=SHA1('kewtm4fn');
insert into `entry_users` set `series`=2,`info`=282,`user_name`='kkma33',`user_pass`=SHA1('wajg97ya');
insert into `entry_users` set `series`=2,`info`=274,`user_name`='kkma26',`user_pass`=SHA1('JAoBNjgb');
*/
?>
